{
    "Header1": "Sobre mim",
    "Header2": "Experiencia",
    "Header3": "Projetos",
    "Header4": "Contato",
    "Description": "Com <span class='underline'>3 anos de experiência</span> como desenvolvedor <span class='underline'>Fullstack</span>, minha prioridade é criar softwares que proporcionem a melhor experiência possível para o meu usuário. Minha especialidade são sistemas end-to-end e além de entregar uma solução adequada, viso escrever códigos limpos, escaláveis e de fácil reutilização nas tecnologias <span class='underline'>.NET, Flutter & Angular</span>.",
    "ActionBtn": "Entrar em contato",
    "AboutTitle": "Sobre mim",
    "AboutParag": [
        "Em meus <span class='underline'>3 anos como desenvolvedor</span>, o mais importante foi aprender a me aprimorar dia após dia. Durante minha trajetória, tive a oportunidade de trabalhar e me aprofundar em processos de <span class='underline'>alta escalabilidade, performando integração e entrega contínua.</span>",
        "Minha jornada teve início com desenvolvimento mobile, utilizando <span class='underline'>Flutter</span>.",
        "E há mais de dois anos me especializei em <span class='underline'>.NET & Angular</span> como principais ferramentas de <span class='underline'>desenvolvimento web</span>",
        "Dentre minhas habilidades, também estão soft skills como trabalhar bem em equipe, organização e assumir o papel de liderança caso necessário, muito devido à minha experiência trabalhando com diferentes profissionais ao longo desses 3 anos."
    ],
    "ExperiencieTitle": "Experiencias",
    "ExperienceJobs": [
        {
            "Tab": "Servcom",
            "Title": "Fullstack Developer",
            "Date": "08/2023 - Atual",
            "Description": [
                "Contribuí na migração de código legado para .NET 3.5, resultando em redução de custos e tempo para o setor de suporte.",
                "Criação de rotinas backend, otimização de recursos e refatoração de lógicas de negócio utilizando C# e .NET 7.",
                "Desenvolvimento e integração de APIs RESTful para pagamentos, implementando as principais formas de pagamento do mercado.",
                "Implementação de componentes de interface utilizando JS puro, impulsionando significativamente a performance no software da empresa.",
                "Integração contínua e metodologias ágeis de desenvolvimento numa equipe multidisciplinar."
            ]
        },
        {
            "Tab": "Freelancer",
            "Title": "Freelancing FPE",
            "Date": "02/2020 - Atual",
            "Description": [
                "Prototipagem e UX design de interfaces web e mobile utilizando Figma e Miro.",
                "Construção de aplicativos performáticos utilizando Flutter, em conjunto com bancos de dados SQL e NoSQL.",
                "Implementação CI/CD com Azure. Refatoração e otimização de sistemas complexos.",
                "Sistemas end-to-end para empresas de pequeno e médio porte."
            ]
        }
    ],
    "ProjectsTitle": "Projetos",
    "ProjectsLabel": "Projeto",
    "ProjectsItens": [
        {
            "Title": "Visão Computacional - Reconhecimento de imagens",
            "Description": "O projeto consiste em utilizar recursos de <span class='underline'>visão computacional</span> para analisar imagens e arquivos de modo a identificar padrões em elementos visuais que possam servir para automatizar processos. Garantindo assim, ganho e otimização de tempo.",
            "Images": [
                "assets/images/img1_cv.jpg"
            ],
            "Technologies": [
                "C#",
                "EMGU CV"
            ]
        },
        {
            "Title": "Langchain - Automatização no processo de extração dinamica de dados",
            "Description": "Como uma extensão do projeto de analise e reconhecimento de imagens, neste projeto foi desenvolvido um sistema em <span class='underline'>Python </span> para lidar com <span class='underline'>extração dinâmica de dados</span> de modo a automatizar o processo de utilização destes dados extrajudiciais pela empresa, permitindo manipulações de maneira simplificada.",
            "Images": [
                "assets/images/result.jpeg",
                "assets/images/langchain.jpeg"
            ],
            "Technologies": [
                "Python",
                "Langchain"
            ]
        }
    ]
}